# *************************************************************************
#
# Copyright © Microsoft Corporation. All rights reserved.
# Copyright © Broadcom Inc. All rights reserved.
# Licensed under the MIT License.
#
# *************************************************************************
set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V -current mA
set_case_analysis 0 [get_pins u_cr_kme_core/kme_is_core_cceip0_key_tlv_rsm/u_cr_tlvp2_rsm/u_cr_fifo_wrap2_tob/ram_fifo_u_nx_fifo_ram_1r1w/ram/lvm]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip0_key_tlv_rsm/u_cr_tlvp2_rsm/u_cr_fifo_wrap2_tob/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/ram/rdt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip0_key_tlv_rsm/u_cr_tlvp2_rsm/u_cr_fifo_wrap2_tob/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/ram/rdt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip0_key_tlv_rsm/u_cr_tlvp2_rsm/u_cr_fifo_wrap2_tob/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/ram/wbt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip0_key_tlv_rsm/u_cr_tlvp2_rsm/u_cr_fifo_wrap2_tob/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/ram/wbt[1]}]
set_case_analysis 0 [get_pins u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/lvm]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d3/ram/rdt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d3/ram/rdt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d3/ram/wbt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d3/ram/wbt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d2/ram/rdt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d2/ram/rdt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d2/ram/wbt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d2/ram/wbt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d1/ram/rdt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d1/ram/rdt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d1/ram/wbt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d1/ram/wbt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d0/ram/rdt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d0/ram/rdt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d0/ram/wbt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_validate_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d0/ram/wbt[1]}]
set_case_analysis 0 [get_pins u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/lvm]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d3/ram/rdt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d3/ram/rdt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d3/ram/wbt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d3/ram/wbt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d2/ram/rdt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d2/ram/rdt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d2/ram/wbt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d2/ram/wbt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d1/ram/rdt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d1/ram/rdt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d1/ram/wbt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d1/ram/wbt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d0/ram/rdt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d0/ram/rdt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d0/ram/wbt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_cceip_encrypt_kop_fifo/ram_fifo/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem0d0/ram/wbt[1]}]
set_case_analysis 0 [get_pins u_cr_kme_core/kme_is_core_txc_axi_intf/u_cr_fifo_wrap2/ram_fifo_u_nx_fifo_ram_1r1w/ram/lvm]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_txc_axi_intf/u_cr_fifo_wrap2/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem/ram/rdt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_txc_axi_intf/u_cr_fifo_wrap2/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem/ram/rdt[1]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_txc_axi_intf/u_cr_fifo_wrap2/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem/ram/wbt[0]}]
set_case_analysis 0 [get_pins {u_cr_kme_core/kme_is_core_txc_axi_intf/u_cr_fifo_wrap2/ram_fifo_u_nx_fifo_ram_1r1w/ram/genblk1_u_ram/mem/ram/wbt[1]}]
create_clock [get_ports clk]  -period 1.25  -waveform {0 0.625}
set_clock_transition -min -fall 0.05 [get_clocks clk]
set_clock_transition -min -rise 0.05 [get_clocks clk]
set_clock_transition -max -fall 0.05 [get_clocks clk]
set_clock_transition -max -rise 0.05 [get_clocks clk]
set_false_path   -from [get_ports rst_n]
set_false_path   -from [get_ports scan_rst_n]
set_false_path   -from [get_ports ovstb]
set_input_delay -clock clk  0.75  [get_ports scan_rst_n]
set_input_delay -clock clk  0.75  [get_ports ovstb]
set_input_delay -clock clk  0.75  [get_ports scan_en]
set_input_delay -clock clk  0.75  [get_ports scan_mode]
set_input_delay -clock clk  0.75  [get_ports lvm]
set_input_delay -clock clk  0.75  [get_ports mlvm]
set_input_delay -clock clk  0.75  [get_ports disable_debug_cmd]
set_input_delay -clock clk  0.75  [get_ports disable_unencrypted_keys]
set_input_delay -clock clk  0.75  [get_ports kme_ib_tvalid]
set_input_delay -clock clk  0.75  [get_ports kme_ib_tlast]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tid[0]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tstrb[7]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tstrb[6]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tstrb[5]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tstrb[4]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tstrb[3]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tstrb[2]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tstrb[1]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tstrb[0]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tuser[7]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tuser[6]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tuser[5]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tuser[4]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tuser[3]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tuser[2]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tuser[1]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tuser[0]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[63]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[62]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[61]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[60]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[59]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[58]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[57]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[56]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[55]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[54]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[53]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[52]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[51]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[50]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[49]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[48]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[47]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[46]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[45]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[44]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[43]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[42]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[41]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[40]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[39]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[38]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[37]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[36]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[35]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[34]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[33]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[32]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[31]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[30]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[29]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[28]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[27]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[26]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[25]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[24]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[23]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[22]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[21]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[20]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[19]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[18]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[17]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[16]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[15]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[14]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[13]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[12]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[11]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[10]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[9]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[8]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[7]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[6]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[5]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[4]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[3]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[2]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[1]}]
set_input_delay -clock clk  0.75  [get_ports {kme_ib_tdata[0]}]
set_input_delay -clock clk  0.75  [get_ports kme_cceip0_ob_tready]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[15]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[14]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[13]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[12]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[11]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[10]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[9]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[8]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[7]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[6]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[5]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[4]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[3]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[2]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[1]}]
set_input_delay -clock clk  0.75  [get_ports {apb_paddr[0]}]
set_input_delay -clock clk  0.75  [get_ports apb_psel]
set_input_delay -clock clk  0.75  [get_ports apb_penable]
set_input_delay -clock clk  0.75  [get_ports apb_pwrite]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[31]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[30]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[29]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[28]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[27]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[26]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[25]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[24]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[23]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[22]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[21]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[20]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[19]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[18]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[17]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[16]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[15]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[14]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[13]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[12]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[11]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[10]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[9]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[8]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[7]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[6]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[5]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[4]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[3]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[2]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[1]}]
set_input_delay -clock clk  0.75  [get_ports {apb_pwdata[0]}]
set_output_delay -clock clk  0.75  [get_ports kme_interrupt]
set_output_delay -clock clk  0.75  [get_ports kme_ib_tready]
set_output_delay -clock clk  0.75  [get_ports kme_cceip0_ob_tvalid]
set_output_delay -clock clk  0.75  [get_ports kme_cceip0_ob_tlast]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tid[0]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tstrb[7]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tstrb[6]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tstrb[5]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tstrb[4]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tstrb[3]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tstrb[2]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tstrb[1]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tstrb[0]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tuser[7]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tuser[6]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tuser[5]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tuser[4]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tuser[3]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tuser[2]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tuser[1]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tuser[0]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[63]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[62]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[61]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[60]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[59]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[58]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[57]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[56]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[55]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[54]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[53]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[52]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[51]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[50]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[49]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[48]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[47]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[46]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[45]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[44]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[43]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[42]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[41]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[40]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[39]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[38]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[37]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[36]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[35]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[34]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[33]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[32]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[31]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[30]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[29]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[28]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[27]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[26]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[25]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[24]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[23]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[22]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[21]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[20]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[19]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[18]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[17]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[16]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[15]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[14]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[13]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[12]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[11]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[10]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[9]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[8]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[7]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[6]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[5]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[4]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[3]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[2]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[1]}]
set_output_delay -clock clk  0.75  [get_ports {kme_cceip0_ob_tdata[0]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[31]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[30]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[29]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[28]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[27]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[26]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[25]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[24]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[23]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[22]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[21]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[20]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[19]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[18]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[17]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[16]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[15]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[14]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[13]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[12]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[11]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[10]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[9]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[8]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[7]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[6]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[5]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[4]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[3]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[2]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[1]}]
set_output_delay -clock clk  0.75  [get_ports {apb_prdata[0]}]
set_output_delay -clock clk  0.75  [get_ports apb_pready]
set_output_delay -clock clk  0.75  [get_ports apb_pslverr]
set_output_delay -clock clk  0.75  [get_ports kme_idle]
